from aiogram import Router
from aiogram.types import Message
from keyboard import main_keyboard

# Создаем роутер
about_router = Router()

@about_router.message(lambda message: message.text == 'ℹ️ О нас')
async def about_command(message: Message):
    about_text = """
🎓 Институт Гастрономии — лидер в образовании для гостеприимства!

🏆 Russian Creative Awards 2022 назвали нас лучшим образовательным проектом.

Почему выбирают нас:
• 👨‍🍳 Преподают шеф-повара-практики
• 🏫 Новейшие оборудованные кухни
• 🤝 Стажировки в ресторанах-партнерах
• 📜 Диплом государственного образца

Где нас найти:
📍 Красноярск, пр. Свободный, 82 ст. 11
📍 Красноярск, ул. Лиды Прушинской, 2
📞 +7 (906) 972-74-41
✉️ postuplenie@gastronomyinstitute.ru
    """
    await message.answer(about_text, reply_markup=main_keyboard)  # Возврат в главное меню
