from aiogram import Router
from aiogram.types import Message
from keyboard import main_keyboard

# Создаем роутер
about_router = Router()

@about_router.message(lambda message: message.text == 'ℹ️ О нас')
async def about_command(message: Message):
    about_text = """
ℹ️ <b>О нашем Институте Гастрономии</b>

Уникальное высшее образование в сфере гостеприимства!

ЛУЧШИЙ ОБРАЗОВАТЕЛЬНЫЙ ПРОЕКТ По версии Russian Creative Awards 2022

<b>Наши преимущества:</b>
🎯 Профессиональные шеф-повара с опытом работы
🎯 Современное оборудование и кухни
🎯 Практика в ресторанах-партнерах
🎯 Сертификат государственного образца
🎯 Гибкий график обучения

<b>Контакты:</b>
📍 Адрес кампуса на Свободном: г. Красноярск, пр. Свободный, 82 ст. 11
📍 Адрес кампуса на Прушкинской: г. Красноярск, ул. Лиды Прушинской, 2
📞 Телефон: +7 (906) 972-74-41
📧 Почта: postuplenie@gastronomyinstitute.ru
    """
    await message.answer(about_text, reply_markup=main_keyboard)  # Возврат в главное меню
