from aiogram import Router
from aiogram.types import Message
from keyboard import get_faq_keyboard, main_keyboard

# Создаем роутер
faq_router = Router()

# Меню FAQ
@faq_router.message(lambda message: message.text == '❓ Частые вопросы')
async def faq_menu(message: Message):
    await message.answer(
        "Выберите интересующий вас вопрос:",
        reply_markup=get_faq_keyboard()
    )

# Конкретные вопросы
@faq_router.message(lambda message: message.text == 'Ваш институт государственный или частный?')
async def faq_price(message: Message):
    await message.answer(
        "Наш институт является государственным, "
        "это структурное подразделение Сибирского Федерального Университета.\n"
        "Институт имеет лицензию №Л035-00115-24/00096964 от 04.07.2016, выданную "
        "Федеральной службой по надзору в сфере образования и науки.\n"
        "А так же: Свидетельство об аккредитации с регистрационным номером "
        "№А007-00115-24/01455162 выдано 19.12.2018",
        reply_markup=get_faq_keyboard()
    )

@faq_router.message(lambda message: message.text == 'Предусмотрены ли бюджетные места для поступления?')
async def faq_duration(message: Message):
    await message.answer(
        "Нет, обучение проводится полностью на платной основе.",
        reply_markup=get_faq_keyboard()
    )

@faq_router.message(lambda message: message.text == 'Могу ли я обучаться заочно?')
async def faq_start(message: Message):
    await message.answer(
        "Заочная форма обучения предусмотрена только для направления магистратуры:\n"
        "Стратегическое управление в индустрии гостеприимства",
        reply_markup=get_faq_keyboard()
    )

@faq_router.message(lambda message: message.text == 'Что нужно для поступления?')
async def faq_requirements(message: Message):
    await message.answer(
        "Необходимо иметь аттестат о среднем (полном) образовании и набрать минимальное количество баллов ЕГЭ.\n"
        "Обязательные предметы:\n"
        "- Математика (профильная) - 40 баллов\n"
        "- Русский язык - 40 баллов\n"
        "Предметы на выбор:\n"
        "- Обществознание - 45 баллов\n"
        "- Информатика и ИКТ - 46 баллов\n"
        "- Иностранный язык - 40 баллов\n"
        "Полный перечень документов, сроки и методы подачи документов можно найти здесь:\n"
        "<a href='https://gastronomyinstitute.ru/for_abiturients'>Абитуриентам</a>",
        reply_markup=get_faq_keyboard()
    )

@faq_router.message(lambda message: message.text == '📞 Связь с администратором')
async def contacts_command(message: Message):
    contacts_text = """
📞 <b>Связь с администратором</b>

<b>Контактные данные:</b>
👨‍💼 <b>Администратор:</b> Иван Иванов
📞 <b>Телефон:</b> +7 (999) 999-99-99
📧 <b>Email:</b> admin@gastronomyinstisute.ru
💬 <b>Telegram:</b> @gastro_admin

<b>Время для связи:</b>
⌚ Пн-Пт: 10:00 - 19:00
⌚ Суббота: 11:00 - 16:00
🚫 Воскресенье: выходной
    """
    await message.answer(contacts_text, reply_markup=main_keyboard)

