from aiogram import Router
from aiogram.types import Message
from keyboard import get_faq_keyboard, main_keyboard

# Создаем роутер
faq_router = Router()

# Меню FAQ
@faq_router.message(lambda message: message.text == '❓ Частые вопросы')
async def faq_menu(message: Message):
    await message.answer(
        "Выберите интересующий вас вопрос:",
        reply_markup=get_faq_keyboard()
    )

# Конкретные вопросы
@faq_router.message(lambda message: message.text == 'Ваш институт государственный или частный?')
async def faq_price(message: Message):
    await message.answer(
        "Мы — часть большого Сибирского Федерального Университета и работаем как государственное учреждение. "
        "У нас есть все официальные документы, подтверждающие качество образования:\n"
        "✅ Лицензия на образовательную деятельность №Л035-00115-24/00096964 (выдана 04.07.2016)\n"
        "✅ Свидетельство об аккредитации №А007-00115-24/01455162 (выдано 19.12.2018)\n"
        "Оба документа выданы Федеральной службой по надзору в сфере образования и науки, так что вы можете быть уверены в качестве нашего обучения! 😊",
        reply_markup=get_faq_keyboard()
    )

@faq_router.message(lambda message: message.text == 'Предусмотрены ли бюджетные места для поступления?')
async def faq_duration(message: Message):
    await message.answer(
        "Нет, обучение в нашем институте проводится на платной основе. "
        "Но мы всегда стараемся сделать его максимально доступным и комфортным для наших студентов! 💙",
        reply_markup=get_faq_keyboard()
    )

@faq_router.message(lambda message: message.text == 'Могу ли я обучаться заочно?')
async def faq_start(message: Message):
    await message.answer(
        "Да, на данный момент у нас доступна заочная форма обучения для одной "
        "магистерской программы — «Стратегическое управление в индустрии гостеприимства». 🎓✨",
        reply_markup=get_faq_keyboard()
    )

@faq_router.message(lambda message: message.text == 'Что нужно для поступления?')
async def faq_requirements(message: Message):
    await message.answer(
        "Для поступления на программу бакалавриата вам понадобятся:\n"
        "1. Аттестат о среднем (полном) общем образовании.\n"
        "2. Результаты ЕГЭ, соответствующие минимальным баллам:\n"
        "Обязательные для всех:\n"
        "📐 Математика (профиль) — от 40 баллов\n"
        "📖 Русский язык — от 40 баллов\n"
        "И один предмет на ваш выбор:\n"
        "🌍 Обществознание — от 45 баллов\n"
        "💻 Информатика и ИКТ — от 46 баллов\n"
        "🌐 Иностранный язык — от 40 баллов\n"
        "Полный перечень документов, сроки и методы подачи документов можно найти здесь:\n"
        "<a href='https://gastronomyinstitute.ru/for_abiturients'>Абитуриентам</a>",
        reply_markup=get_faq_keyboard()
    )

@faq_router.message(lambda message: message.text == '📞 Связь с администратором')
async def contacts_command(message: Message):
    contacts_text = """
📞 <b>Связь с администратором</b>

<b>Контактные данные:</b>
👨‍💼 <b>Администратор:</b> Иван Иванов
📞 <b>Телефон:</b> +7 (999) 999-99-99
📧 <b>Email:</b> admin@gastronomyinstisute.ru
💬 <b>Telegram:</b> @gastro_admin

<b>Время для связи:</b>
⌚ Пн-Пт: 10:00 - 19:00
⌚ Суббота: 11:00 - 16:00
🚫 Воскресенье: выходной
    """
    await message.answer(contacts_text, reply_markup=main_keyboard)

